20230930142832-cpp.org
:PROPERTIES:
:ID:       0bc00581-7df0-494d-a175-b0ff5145b9a8
:mtime:    20241102180218 20241028101410
:ctime:    20230930142832
:END:
#+title: Cpp
* 概要
C++は[[id:868ac56a-2d42-48d7-ab7f-7047c85a8f39][Programming Language]]のひとつ。
* Memo
** インライン展開
inline キーワードは、この関数が小さなコードサイズであることを示し、コンパイラに対して可能な限り関数の呼び出しを展開して最適化するよう指示する。これにより、関数呼び出しのオーバーヘッドが減少し、効率的なコードを生成する可能性が高まる。ただし、inline はコンパイラへの提案であり、コンパイラが実際に展開するかどうかはコンパイラの判断に依存する。

#+caption: 演算子オーバライドを、インライン展開する
#+begin_src c++
static inline koord3d operator + (const koord3d& a, const koord3d& b)
{
	return koord3d(a.x + b.x, a.y + b.y, a.z + b.z);
}
#+end_src
* Tasks
* Reference
* Archives
