20230930142832-cpp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-04-23 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Cpp</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">Cpp</h1>
<div id="outline-container-org47b44ff" class="outline-2">
<h2 id="org47b44ff"><a href="#org47b44ff">概要</a></h2>
<div class="outline-text-2" id="text-org47b44ff">
<p>
C++は<a href="20210509101246-programming_language.html#ID-868ac56a-2d42-48d7-ab7f-7047c85a8f39">Programming Language</a>のひとつ。
</p>
</div>
</div>
<div id="outline-container-org2ce0898" class="outline-2">
<h2 id="org2ce0898"><a href="#org2ce0898">Memo</a></h2>
<div class="outline-text-2" id="text-org2ce0898">
</div>
<div id="outline-container-orgbec9ae0" class="outline-3">
<h3 id="orgbec9ae0"><a href="#orgbec9ae0">インライン展開</a></h3>
<div class="outline-text-3" id="text-orgbec9ae0">
<p>
inline キーワードは、この関数が小さなコードサイズであることを示し、コンパイラに対して可能な限り関数の呼び出しを展開して最適化するよう指示する。これにより、関数呼び出しのオーバーヘッドが減少し、効率的なコードを生成する可能性が高まる。ただし、inline はコンパイラへの提案であり、コンパイラが実際に展開するかどうかはコンパイラの判断に依存する。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>演算子オーバライドを、インライン展開する</label><pre class="src src-c++"><span class="org-keyword">static</span> <span class="org-keyword">inline</span> <span class="org-type">koord3d</span> <span class="org-keyword">operator</span> <span class="org-function-name">+</span> (<span class="org-keyword">const</span> <span class="org-type">koord3d</span>&amp; <span class="org-variable-name">a</span>, <span class="org-keyword">const</span> <span class="org-type">koord3d</span>&amp; <span class="org-variable-name">b</span>)
{
        <span class="org-keyword">return</span> koord3d(a.x + b.x, a.y + b.y, a.z + b.z);
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3949a06" class="outline-2">
<h2 id="org3949a06"><a href="#org3949a06">Tasks</a></h2>
</div>
<div id="outline-container-orgdeade9c" class="outline-2">
<h2 id="orgdeade9c"><a href="#orgdeade9c">Reference</a></h2>
</div>
<div id="outline-container-orgedb1b2f" class="outline-2">
<h2 id="orgedb1b2f"><a href="#orgedb1b2f">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
